{
    "common": {
        "name":                     "google-sharedlocations",
        "version":                  "1.6.0",
        "license":                  "MIT",
        "authors": [
          "Christian Vorholt <chvorholt@gmail.com>"
        ],
        "news": {
          "1.6.0":  {
            "en": "Cookie can be retrieved via proxy.",
            "de": "Das Cookie kann über einen Proxy abgerufen werden.",
            "ru": "Cookie можно получить через прокси.",
            "pt": "Cookie pode ser recuperado via proxy.",
            "nl": "Cookie kan worden opgehaald via proxy.",
            "fr": "Le cookie peut être récupéré via un proxy.",
            "it": "I cookie possono essere recuperati tramite proxy.",
            "es": "La cookie se puede recuperar a través de proxy.",
            "pl": "Plik cookie można pobrać za pośrednictwem serwera proxy."
          },
          "1.5.4": {
            "en": "surplus usergroups are no longer created",
            "de": "überschüssige Benutzergruppen werden nicht mehr erstellt",
            "ru": "лишние группы пользователей больше не создаются",
            "pt": "grupos de usuários excedentes não são mais criados",
            "nl": "overtollige gebruikersgroepen worden niet langer aangemaakt",
            "fr": "les groupes d'utilisateurs en surplus ne sont plus créés",
            "it": "gli utenti in eccedenza non vengono più creati",
            "es": "los grupos de usuarios excedentes ya no se crean",
            "pl": "nadmiarowe grupy użytkowników nie są już tworzone",
            "zh-cn": "不再创建剩余用户组"
          },
          "1.5.3": {
            "en": "updated npm dependencies and integrated adapter core",
            "de": "Aktualisierte NPM-Abhängigkeiten und integrierter Adapterkern",
            "ru": "обновлены зависимости npm и встроенное ядро ​​адаптера",
            "pt": "dependências atualizadas do npm e núcleo do adaptador integrado",
            "nl": "bijgewerkte npm-afhankelijkheden en geïntegreerde adapterkern",
            "fr": "dépendances npm mises à jour et noyau d'adaptateur intégré",
            "it": "dipendenze aggiornate di npm e core adattatore integrato",
            "es": "Dependencias npm actualizadas y núcleo adaptador integrado.",
            "pl": "zaktualizowane zależności npm i zintegrowany rdzeń adaptera",
            "zh-cn": "更新的npm依赖项和集成的适配器核心"
          },
          "1.5.2": {
            "en": "Fence is now updated correctly.",
            "de": "Zaun wird jetzt korrekt aktualisiert.",
            "ru": "Забор теперь обновляется правильно.",
            "pt": "Cerca agora é atualizada corretamente.",
            "nl": "Fence is nu correct bijgewerkt.",
            "fr": "La clôture est maintenant mise à jour correctement.",
            "it": "Il recinto è ora aggiornato correttamente.",
            "es": "La cerca ahora se ha actualizado correctamente.",
            "pl": "Ogrodzenie jest teraz poprawnie aktualizowane."
          },
          "1.5.1": {
            "en": "Changed location of trigger poll state. States are now members of named groups.",
            "de": "Geänderte Position des Trigger-Poll-Status. Zustände sind jetzt Mitglieder von benannten Gruppen.",
            "ru": "Изменено местоположение состояния опроса триггеров. Государства теперь являются членами названных групп.",
            "pt": "Localização alterada do estado de pesquisa do acionador. Os estados são agora membros de grupos nomeados.",
            "nl": "Gewijzigde locatie van trigger poll-status. Staten zijn nu lid van benoemde groepen.",
            "fr": "Emplacement modifié de l'état d'interrogation du déclencheur. Les États sont désormais membres de groupes nommés.",
            "it": "Posizione modificata dello stato di polling del trigger. Gli stati sono ora membri di gruppi con nome.",
            "es": "Se modificó la ubicación del estado de sondeo de activación. Los estados ahora son miembros de grupos nombrados.",
            "pl": "Zmieniono lokalizację stanu sondowania spustu. Stany są teraz członkami nazwanych grup."
          },
          "1.5.0": {
            "en": "Added GPS accuracy. Adapter should be more robust against datagram changes.",
            "de": "GPS-Genauigkeit hinzugefügt Der Adapter sollte robuster gegen Datagrammänderungen sein.",
            "ru": "Добавлена ​​точность GPS. Адаптер должен быть более устойчивым к изменениям дейтаграмм.",
            "pt": "Adicionado precisão do GPS. Adaptador deve ser mais robusto contra alterações de datagrama.",
            "nl": "GPS-nauwkeurigheid toegevoegd. Adapter moet robuuster zijn tegen datagramwijzigingen.",
            "fr": "Ajout de la précision GPS. L'adaptateur doit être plus robuste contre les changements de datagramme.",
            "it": "Aggiunta la precisione del GPS. L'adattatore dovrebbe essere più robusto contro le modifiche del datagramma.",
            "es": "Se agregó precisión GPS. El adaptador debe ser más robusto contra los cambios en los datagramas.",
            "pl": "Dodano dokładność GPS. Adapter powinien być bardziej odporny na zmiany datagramów."
          },
          "1.4.1": {
            "en": "Missing Places-Adapter support fixed. Fixed translation issues with polling-time.",
            "de": "Fehlende Orte - Adapterunterstützung behoben. Probleme bei der Übersetzung mit Polling-Zeit behoben.",
            "ru": "Исправлена ​​поддержка пропущенных мест-адаптеров. Исправлены проблемы перевода с периодом опроса.",
            "pt": "Suporte ausente para lugares-adaptadores corrigido. Correção de problemas de tradução com o tempo de pesquisa.",
            "nl": "Ontbrekende plaatsen-Adapter-ondersteuning opgelost. Vaste vertaalproblemen met polling-tijd.",
            "fr": "Prise en charge des adaptateurs manquants Correction de problèmes de traduction avec le temps d'interrogation.",
            "it": "Posti mancanti: il supporto dell'adattatore è stato risolto. Risolti i problemi di traduzione con il tempo di polling.",
            "es": "Falta el soporte de adaptadores de lugares fijo. Se corrigieron los problemas de traducción con el tiempo de sondeo.",
            "pl": "Naprawiono brakujące wsparcie dla adaptera lokalizacji. Naprawiono problemy z tłumaczeniem z czasem głosowania."
          },
          "1.4.0":  {
            "en": "Fences id can be customized now. Fences states are properly added and removed.",
            "de": "Fences ID kann jetzt angepasst werden. Fences-Zustände werden ordnungsgemäß hinzugefügt und entfernt.",
            "ru": "Идентификатор Fences теперь можно настроить. Состояние забора правильно добавляется и удаляется.",
            "pt": "ID de cercas pode ser personalizado agora. Os estados de cercas são devidamente adicionados e removidos.",
            "nl": "Omheiningsidentificatie kan nu worden aangepast. Omheiningen worden correct toegevoegd en verwijderd.",
            "fr": "L'identification des clôtures peut être personnalisée maintenant. Les états des clôtures sont correctement ajoutés et supprimés.",
            "it": "L'ID di recinti può essere personalizzato ora. Gli stati dei recinti sono stati correttamente aggiunti e rimossi.",
            "es": "La identificación de Fences se puede personalizar ahora. Los estados de cercas se agregan y eliminan correctamente.",
            "pl": "Fences id można teraz dostosować. Stany ogrodzeń są odpowiednio dodawane i usuwane."
          },
          "1.3.0": {
            "en": "locations poll can be triggered by a state or by sending a message to the adapter",
            "de": "Die Standortabfrage kann durch einen Status ausgelöst werden oder indem eine Nachricht an den Adapter gesendet wird",
            "ru": "опрос местоположений может быть вызван состоянием или путем отправки сообщения на адаптер",
            "pt": "polls de localização podem ser acionados por um estado ou enviando uma mensagem para o adaptador",
            "nl": "locatie poll kan worden geactiveerd door een staat of door een bericht naar de adapter te sturen",
            "fr": "les emplacements peuvent être déclenchés par un état ou en envoyant un message à l'adaptateur",
            "it": "il sondaggio delle località può essere attivato da uno stato o inviando un messaggio all'adattatore",
            "es": "la encuesta de ubicaciones puede ser activada por un estado o enviando un mensaje al adaptador",
            "pl": "Sonda lokalizacji może zostać wywołana przez stan lub wysyłając wiadomość do adaptera"
          },
          "1.2.0" : {
            "en": "state added showing the battery level and timestamp",
            "de": "Status hinzugefügt, der den Batteriestand und den Zeitstempel anzeigt",
            "ru": "добавлено состояние, показывающее уровень заряда батареи и временную метку",
            "pt": "estado adicionado mostrando o nível da bateria e o timestamp",
            "nl": "status toegevoegd die het batterijniveau en tijdstempel toont",
            "fr": "état ajouté indiquant le niveau de batterie et l'horodatage",
            "it": "stato aggiunto che mostra il livello della batteria e il timestamp",
            "es": "estado agregado que muestra el nivel de batería y la marca de tiempo",
            "pl": "dodano stan pokazujący poziom naładowania baterii i datownik"
          },
          "1.1.4" : {
            "en": "fixed roles",
            "de": "feste Rollen",
            "ru": "фиксированные роли",
            "pt": "papéis fixos",
            "nl": "vaste rollen",
            "fr": "rôles fixes",
            "it": "ruoli fissi",
            "es": "roles fijos",
            "pl": "naprawione role"
          },
          "1.1.3" : {
            "en": "fix installation problem",
            "de": "Installationsproblem beheben",
            "ru": "устранить проблему установки",
            "pt": "corrigir problema de instalação",
            "nl": "fix installatie probleem",
            "fr": "résoudre le problème d'installation",
            "it": "risolvere il problema di installazione",
            "es": "arreglar problema de instalación",
            "pl": "napraw problem z instalacją"
          },
          "1.1.2": {
            "en": "Preparations for publishing the adapter.",
            "de": "Vorbereitungen für die Veröffentlichung des Adapters.",
            "ru": "Подготовка к публикации адаптера.",
            "pt": "Preparações para publicar o adaptador.",
            "nl": "Voorbereidingen voor het publiceren van de adapter.",
            "fr": "Préparations pour la publication de l'adaptateur.",
            "it": "Preparativi per la pubblicazione dell'adattatore.",
            "es": "Preparativos para publicar el adaptador.",
            "pl": "Przygotowania do opublikowania adaptera."
          },
          "1.1.1": {
            "en": "Users can be simply selected in the admin config, i.e. userid need not to be entered manually.",
            "de": "Benutzer können einfach in der Admin-Konfiguration ausgewählt werden, d.h. Benutzer-ID muss nicht manuell eingegeben werden.",
            "ru": "Пользователи могут быть просто выбраны в конфигурации администратора, т. Е. Пользователю не нужно вводить вручную.",
            "pt": "Os usuários podem ser simplesmente selecionados na configuração de administração, ou seja, o ID do usuário não precisa ser inserido manualmente.",
            "nl": "Gebruikers kunnen eenvoudig worden geselecteerd in de admin config, d.w.z. userid hoeft niet handmatig te worden ingevoerd.",
            "fr": "Les utilisateurs peuvent être simplement sélectionnés dans la configuration admin, c.-à-d. Que l'ID utilisateur n'a pas besoin d'être saisi manuellement.",
            "it": "Gli utenti possono essere semplicemente selezionati nella configurazione dell'amministratore, cioè l'ID utente non deve essere inserito manualmente.",
            "es": "Los usuarios pueden simplemente seleccionarse en la configuración de administrador, es decir, el ID de usuario no necesita ser ingresado manualmente.",
            "pl": "Użytkownicy mogą być po prostu wybrani w konfiguracji administratora, tj. Identyfikator użytkownika nie musi być wprowadzany ręcznie."
          },
          "1.1.0": {
            "en": "Store address of the user in a state.",
            "de": "Geschäftsadresse des Benutzers in einem Zustand speichern.",
            "ru": "Храните адрес пользователя в состоянии.",
            "pt": "Armazene o endereço do usuário em um estado.",
            "nl": "Bewaar het adres van de gebruiker in een staat.",
            "fr": "Adresse de stockage de l'utilisateur dans un état.",
            "it": "Memorizza l'indirizzo dell'utente in uno stato.",
            "es": "Almacenar la dirección del usuario en un estado.",
            "pl": "Przechowuj adres użytkownika w stanie."
          },
          "1.0.1": {
            "en": "Code cleanup. Moved authentification to a separate module.",
            "de": "Codebereinigung Die Authentifizierung wurde in ein separates Modul verschoben.",
            "ru": "Очистка кода. Перемещенная проверка подлинности на отдельный модуль.",
            "pt": "Limpeza de código. Movido a autenticação para um módulo separado.",
            "nl": "Code opschonen. Verificatie naar een afzonderlijke module verplaatst.",
            "fr": "Nettoyage du code Déplacement de l'authentification vers un module distinct.",
            "it": "Pulizia del codice. Spostamento dell'autenticazione in un modulo separato.",
            "es": "Limpieza del código Se movió la autenticación a un módulo separado.",
            "pl": "Oczyszczanie kodu. Przeniesiono uwierzytelnianie do osobnego modułu."
          },
          "1.0.0": {
            "en": "Added support for Admin3.",
            "de": "Unterstützung für Admin3 hinzugefügt.",
            "ru": "Добавлена ​​поддержка Admin3.",
            "pt": "Adicionado suporte para Admin3.",
            "nl": "Ondersteuning toegevoegd voor Admin3.",
            "fr": "Ajout du support pour Admin3.",
            "it": "Aggiunto supporto per Admin3.",
            "es": "Se agregó soporte para Admin3.",
            "pl": "Dodano obsługę Admin3."
          }
        },
        "title": "Google shared locations",
        "titleLang": {
          "en": "An ioBroker adapter for retrieving locations from Google shared locations",
          "de": "Ein ioBroker-Adapter zum Abrufen von freigegebenen Google-Standorten",
          "ru": "Адаптер ioBroker для поиска местоположений из общих мест Google",
          "pt": "Um adaptador ioBroker para recuperar locais de locais compartilhados do Google",
          "nl": "Een ioBroker-adapter voor het ophalen van locaties van gedeelde Google-locaties",
          "fr": "Un adaptateur ioBroker pour récupérer des emplacements à partir d'emplacements partagés Google",
          "it": "Un adattatore ioBroker per il recupero di posizioni da posizioni condivise di Google",
          "es": "Un adaptador ioBroker para recuperar ubicaciones de ubicaciones compartidas de Google",
          "pl": "Adapter ioBroker do pobierania lokalizacji z udostępnianych lokalizacji Google"
        },
        "desc": {
          "en": "Locations of family members or friends can be retrieved from Google shared locations if they share their location.",
          "de": "Standorte von Familienmitgliedern oder Freunden können von freigegebenen Google-Standorten abgerufen werden, wenn sie ihren Standort teilen.",
          "ru": "Положения членов семьи или друзей могут быть получены из общих мест Google, если они делят свое местоположение.",
          "pt": "Locais de membros da família ou amigos podem ser recuperados de locais compartilhados do Google se eles compartilharem sua localização.",
          "nl": "Locaties van familieleden of vrienden kunnen worden opgehaald op gedeelde locaties van Google als ze hun locatie delen.",
          "fr": "Les emplacements des membres de la famille ou des amis peuvent être récupérés à partir des emplacements partagés de Google s'ils partagent leur emplacement.",
          "it": "Le posizioni di familiari o amici possono essere recuperate dalle posizioni condivise di Google se condividono la loro posizione.",
          "es": "Las ubicaciones de los miembros de la familia o amigos pueden recuperarse de las ubicaciones compartidas de Google si comparten su ubicación.",
          "pl": "Lokalizacje członków rodziny lub znajomych można pobierać z udostępnianych lokalizacji Google, jeśli udostępniają swoją lokalizację."
        },
        "platform":                 "Javascript/Node.js",
        "mode":                     "daemon",
        "icon":                     "google-sharedlocations.png",
        "enabled":                  false,
        "stopBeforeUpdate":         true,
        "extIcon":                  "https://raw.githubusercontent.com/t4qjXH8N/ioBroker.google-sharedlocations/master/admin/google-sharedlocations.png",
        "keywords":                 ["google", "geofence", "sharedlocations"],
        "readme":                   "https://github.com/t4qjXH8N/ioBroker.google-sharedlocations/blob/master/README.md",
        "loglevel":                 "info",
        "type":                     "geoposition",
        "materialize":              true,
        "messagebox":               true,
        "restartAdapters":          []
    },
    "native": {
      "google_username": "",
      "google_password": "",
      "google_polling_interval": "600",
      "places_adapter": "",
      "cookie_string": "",
      "fences": []
    },
    "objects": [
    ],
    "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": "connected",
        "desc": "Connected to Google",
        "type": "boolean",
        "def": "false",
        "read": "true",
        "role": "value.info",
        "write": "false"
        },
      "native": {}
      },
      {
        "_id": "info.cookies",
        "type": "state",
        "common": {
          "name": "cookie",
          "desc": "Google Cookies used for authentification",
          "type": "string",
          "def": "false",
          "read": "true",
          "role": "json",
          "write": "false"
        },
        "native": {}
      },
      {
        "_id": "trigger_poll",
        "type": "state",
        "common": {
          "name": "poll",
          "desc": "Setting to true issues a poll.",
          "type": "boolean",
          "def": "false",
          "read": "true",
          "write": "true",
          "role": "button"
        },
        "native": {}
      },
      {
        "_id": "fence",
        "type": "",
        "common": {
          "name": "Geofences",
          "desc": "States for fences defined in the config."
        },
        "native": {}
      },
      {
        "_id": "user",
        "type": "",
        "common": {
          "name": "Users",
          "desc": "Retrieved information on users."
        },
        "native": {}
      }
  ]
}
